#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-X26osQ6JPezBiYsj

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.database.random_password.database_admin_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=5b26b697-bd46-8986-882e-8d464a869dcd]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=1f925157-0a72-7ffc-0dc5-688f3f39570f]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_container_read_policy: Refreshing state... [id=eks-node-group-service-20210718215214601100000001]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.kubernetes.aws_internet_gateway.gateway: Refreshing state... [id=igw-072010f2418cb3795]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.kubernetes.aws_route_table.route_table: Refreshing state... [id=rtb-05eec23c01822e230]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E32KMXMEZQQYJK]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=151240493]
module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=ERG8JFP6OLXF]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.kubernetes.aws_eks_cluster.fluentlabs: Refreshing state... [id=fluentlabsprod]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/preprod.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/www.fluentlabs.io-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.kubernetes.aws_eks_node_group.jobs: Refreshing state... [id=fluentlabsprod:jobs]
module.kubernetes.aws_eks_node_group.services: Refreshing state... [id=fluentlabsprod:services]
module.kubernetes.aws_eks_addon.vpc_cni: Refreshing state... [id=fluentlabsprod:vpc-cni]
module.kubernetes.aws_eks_addon.kube_proxy: Refreshing state... [id=fluentlabsprod:kube-proxy]
module.kubernetes.aws_eks_addon.coredns: Refreshing state... [id=fluentlabsprod:coredns]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.fluentlabs.io-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.api.kubernetes_deployment.api is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "default/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 2 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ resource_version = "839168" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "410d41e8-67d2-4e80-9858-3fa36cff75c6" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_LEARNERS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_SPANISH_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "elasticsearch-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_URL"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_USERNAME"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_AUDIENCE"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_DOMAIN"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      ~ volume_mount {
                            name              = "flrcredentials"
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged blocks hidden)
                    }

                  ~ image_pull_secrets {
                      ~ name = "regcred" -> (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  ~ volume {
                        name = "flrcredentials"

                      ~ secret {
                          - optional     = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.content.kubernetes_deployment.prefect will be destroyed
  - resource "kubernetes_deployment" "prefect" {
      - id               = "default/prefect-agent" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {
              - "app" = "prefect-agent"
            } -> null
          - name             = "prefect-agent" -> null
          - namespace        = "default" -> null
          - resource_version = "831745" -> null
          - uid              = "fa174082-a18d-40dd-ade9-8ee815dea2a8" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "1" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "prefect-agent"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "app" = "prefect-agent"
                    } -> null
                }

              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - service_account_name             = "prefect-agent" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [
                          - "prefect agent kubernetes start",
                        ] -> null
                      - command                    = [
                          - "/bin/bash",
                          - "-c",
                        ] -> null
                      - image                      = "prefecthq/prefect:0.14.3-python3.8" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "agent" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - env {
                          - name = "PREFECT__CLOUD__AGENT__AUTH_TOKEN" -> null

                          - value_from {

                              - secret_key_ref {
                                  - key      = "token" -> null
                                  - name     = "prefect-auth" -> null
                                  - optional = false -> null
                                }
                            }
                        }
                      - env {
                          - name  = "PREFECT__CLOUD__API" -> null
                          - value = "https://api.prefect.io" -> null
                        }
                      - env {
                          - name  = "NAMESPACE" -> null
                          - value = "default" -> null
                        }
                      - env {
                          - name  = "IMAGE_PULL_SECRETS" -> null
                          - value = "regcred" -> null
                        }
                      - env {
                          - name  = "PREFECT__CLOUD__AGENT__LABELS" -> null
                          - value = "['default']" -> null
                        }
                      - env {
                          - name  = "JOB_MEM_REQUEST" -> null
                          - value = "100Mi" -> null
                        }
                      - env {
                          - name  = "JOB_MEM_LIMIT" -> null
                          - value = "500Mi" -> null
                        }
                      - env {
                          - name  = "JOB_CPU_REQUEST" -> null
                          - value = "250m" -> null
                        }
                      - env {
                          - name  = "JOB_CPU_LIMIT" -> null
                          - value = "500m" -> null
                        }
                      - env {
                          - name  = "IMAGE_PULL_POLICY" -> null
                          - value = "Always" -> null
                        }
                      - env {
                          - name  = "SERVICE_ACCOUNT_NAME" -> null
                          - value = "prefect-agent" -> null
                        }
                      - env {
                          - name  = "PREFECT__BACKEND" -> null
                          - value = "cloud" -> null
                        }
                      - env {
                          - name  = "PREFECT__CLOUD__AGENT__AGENT_ADDRESS" -> null
                          - value = "http://:8080" -> null
                        }

                      - liveness_probe {
                          - failure_threshold     = 2 -> null
                          - initial_delay_seconds = 40 -> null
                          - period_seconds        = 40 -> null
                          - success_threshold     = 1 -> null
                          - timeout_seconds       = 1 -> null

                          - http_get {
                              - path   = "/api/health" -> null
                              - port   = "8080" -> null
                              - scheme = "HTTP" -> null
                            }
                        }

                      - resources {
                          - limits   = {
                              - "cpu"    = "100m"
                              - "memory" = "128Mi"
                            } -> null
                          - requests = {
                              - "cpu"    = "100m"
                              - "memory" = "128Mi"
                            } -> null
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.content.kubernetes_role.prefect_agent will be destroyed
  - resource "kubernetes_role" "prefect_agent" {
      - id = "default/prefect-agent-rbac" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "prefect-agent-rbac" -> null
          - namespace        = "default" -> null
          - resource_version = "827894" -> null
          - uid              = "df924e9d-3633-4314-9b5e-7352da519f7c" -> null
        }

      - rule {
          - api_groups     = [
              - "batch",
              - "extensions",
            ] -> null
          - resource_names = [] -> null
          - resources      = [
              - "jobs",
            ] -> null
          - verbs          = [
              - "*",
            ] -> null
        }
      - rule {
          - api_groups     = [
              - "",
            ] -> null
          - resource_names = [] -> null
          - resources      = [
              - "events",
              - "pods",
            ] -> null
          - verbs          = [
              - "*",
            ] -> null
        }
    }

  # module.infrastructure.module.content.kubernetes_role_binding.prefect_agent will be destroyed
  - resource "kubernetes_role_binding" "prefect_agent" {
      - id = "default/prefect-agent-rbac" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "prefect-agent-rbac" -> null
          - namespace        = "default" -> null
          - resource_version = "827900" -> null
          - uid              = "4985f92e-7757-446e-90a9-d800eefc3ed6" -> null
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Role" -> null
          - name      = "prefect-agent-rbac" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "prefect-agent" -> null
          - namespace = "default" -> null
        }
    }

  # module.infrastructure.module.content.kubernetes_service_account.prefect_agent will be destroyed
  - resource "kubernetes_service_account" "prefect_agent" {
      - automount_service_account_token = true -> null
      - default_secret_name             = "prefect-agent-token-jvn6z" -> null
      - id                              = "default/prefect-agent" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "prefect-agent" -> null
          - namespace        = "default" -> null
          - resource_version = "827878" -> null
          - uid              = "50e4183e-dd29-4ad6-8898-91995b976641" -> null
        }

      - secret {
          - name = "prefect-auth" -> null
        }
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "language_service" {
      ~ id               = "default/language-service" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
          ~ resource_version = "831743" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "d19e0351-f977-47c5-97dc-25f2d86f9b22" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "language-service"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)


                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                        # (2 unchanged blocks hidden)
                    }

                  ~ image_pull_secrets {
                      ~ name = "regcred" -> (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 0 to change, 6 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
